{
    "hola": "¡Hola! ¿En qué puedo ayudarte con programación hoy?",
    "python": "Python es un lenguaje muy versátil. ¿Tienes alguna duda en específico?",
    "javascript": "JavaScript es esencial para el desarrollo web. ¿Necesitas ayuda con el DOM o frameworks?",
    "java": "Java es robusto y orientado a objetos. ¿Te interesa saber sobre sus conceptos o frameworks como Spring?",
    "c++": "C++ es poderoso para aplicaciones de alto rendimiento. ¿Tienes dudas sobre punteros o manejo de memoria?",
    "c#": "C# se utiliza en desarrollo de aplicaciones Windows y videojuegos con Unity. ¿En qué puedo ayudarte?",
    "ruby": "Ruby es conocido por su sintaxis elegante. ¿Has probado Rails para desarrollo web?",
    "php": "PHP es ampliamente usado en el desarrollo web. ¿Necesitas ayuda con Laravel o WordPress?",
    "sql": "SQL es el lenguaje estándar para gestionar bases de datos. ¿Tienes alguna consulta sobre consultas o índices?",
    "html": "HTML es la columna vertebral de la web. ¿Quieres aprender sobre etiquetas o estructura semántica?",
    "css": "CSS da estilo a las páginas web. ¿Buscas información sobre Flexbox, Grid o animaciones?",
    "debug": "Depurar el código es crucial para resolver errores. ¿Te gustaría conocer técnicas de debugging?",
    "error": "Los errores son parte del proceso de aprendizaje. ¿Podrías compartir el mensaje de error?",
    "variable": "Las variables almacenan datos en un programa. ¿Tienes dudas sobre su declaración o alcance?",
    "funcion": "Las funciones permiten reutilizar código. ¿Te interesa aprender sobre parámetros o retornos?",
    "bucle": "Los bucles facilitan la repetición de tareas. ¿Quieres ejemplos de for, while o do-while?",
    "while": "El bucle while ejecuta mientras la condición sea verdadera. ¿Tienes algún caso concreto?",
    "for": "El bucle for es útil para iteraciones conocidas. ¿Quieres ver un ejemplo práctico?",
    "array": "Los arrays almacenan listas de elementos. ¿Necesitas ayuda para iterarlos o manipularlos?",
    "lista": "Las listas son estructuras dinámicas en muchos lenguajes. ¿Buscas operaciones básicas o avanzadas?",
    "diccionario": "Los diccionarios asocian claves a valores, muy útiles en Python. ¿Te gustaría un ejemplo?",
    "objeto": "La programación orientada a objetos se basa en la manipulación de objetos. ¿Tienes dudas sobre ellos?",
    "clase": "Las clases definen la estructura de los objetos. ¿Necesitas ayuda con métodos o atributos?",
    "herencia": "La herencia permite compartir comportamientos entre clases. ¿Te gustaría ver un ejemplo en OOP?",
    "polimorfismo": "El polimorfismo permite usar una misma interfaz para distintas implementaciones. ¿Quieres saber más?",
    "encapsulacion": "La encapsulación protege los datos internos de un objeto. ¿Te interesa aprender cómo implementarla?",
    "oop": "La programación orientada a objetos es fundamental en muchos lenguajes. ¿Tienes alguna duda específica?",
    "programacion": "La programación es una herramienta poderosa para resolver problemas. ¿Sobre qué tema necesitas ayuda?",
    "algoritmo": "Los algoritmos son procedimientos paso a paso para resolver problemas. ¿Te gustaría un ejemplo?",
    "compilar": "Compilar traduce el código fuente a un lenguaje de máquina. ¿Tienes problemas con tu compilador?",
    "compilador": "El compilador transforma el código en un ejecutable. ¿Buscas optimización o solución de errores?",
    "ejecucion": "La ejecución es el proceso de correr un programa en una máquina. ¿Tienes dudas sobre tiempo de ejecución?",
    "runtime": "El runtime es el entorno en que se ejecuta tu código. ¿Necesitas información sobre manejo de memoria?",
    "optimizacion": "La optimización mejora el rendimiento del código. ¿Te interesa optimizar algoritmos o consultas?",
    "ide": "Un IDE facilita la escritura y depuración de código. ¿Estás usando Visual Studio, PyCharm u otro?",
    "framework": "Los frameworks aceleran el desarrollo de aplicaciones. ¿Buscas recomendaciones para web o móvil?",
    "react": "React es una biblioteca para construir interfaces de usuario dinámicas. ¿Te gustaría ver ejemplos de componentes?",
    "angular": "Angular es un framework robusto para aplicaciones web. ¿Te interesa aprender sobre inyección de dependencias?",
    "vue": "Vue.js es un framework progresivo para la construcción de interfaces. ¿Quieres conocer sus ventajas?",
    "node": "Node.js permite ejecutar JavaScript en el servidor. ¿Necesitas ayuda con módulos o manejo de eventos?",
    "express": "Express es un framework minimalista para Node.js. ¿Quieres aprender sobre rutas o middleware?",
    "django": "Django es un framework de Python que sigue el patrón MTV. ¿Necesitas ayuda con modelos o vistas?",
    "flask": "Flask es un microframework en Python, ideal para proyectos pequeños. ¿Te gustaría un ejemplo de ruta?",
    "spring": "Spring es un framework de Java muy popular para aplicaciones empresariales. ¿Tienes dudas sobre su configuración?",
    "laravel": "Laravel es un framework PHP elegante y fácil de usar. ¿Quieres aprender sobre migraciones o Eloquent ORM?",
    "asp.net": "ASP.NET es un framework de Microsoft para el desarrollo web. ¿Necesitas asistencia con C# o Razor?",
    "api": "Las APIs permiten la comunicación entre diferentes aplicaciones. ¿Te gustaría saber sobre REST o GraphQL?",
    "rest": "REST es un estilo arquitectónico para diseñar APIs escalables. ¿Tienes dudas sobre endpoints o métodos HTTP?",
    "graphql": "GraphQL ofrece una forma flexible de interactuar con APIs. ¿Quieres aprender sobre queries y mutations?",
    "json": "JSON es un formato ligero para el intercambio de datos. ¿Necesitas ejemplos de cómo manipularlo?",
    "xml": "XML es un formato de marcado para datos estructurados. ¿Te interesa convertir XML a otros formatos?",
    "async": "La programación asíncrona mejora la eficiencia del código. ¿Te gustaría ver ejemplos con async/await?",
    "await": "La palabra clave await se usa para manejar promesas en JavaScript. ¿Quieres un ejemplo práctico?",
    "promesa": "Las promesas facilitan la gestión de operaciones asíncronas. ¿Te interesa aprender cómo encadenarlas?",
    "callback": "Los callbacks son funciones que se ejecutan tras completar una tarea. ¿Quieres conocer sus ventajas?",
    "closure": "Los closures permiten acceder a variables de un ámbito externo. ¿Te gustaría ver un ejemplo en JavaScript?",
    "lambda": "Las funciones lambda son anónimas y concisas. ¿Te interesa ver ejemplos en Python o Java?",
    "anonima": "Las funciones anónimas se usan para tareas rápidas sin declarar una función formal. ¿Quieres saber más?",
    "stacktrace": "El stacktrace muestra la secuencia de llamadas en un error. ¿Necesitas ayuda para interpretarlo?",
    "sqlinjection": "La inyección SQL es una vulnerabilidad grave. ¿Te gustaría saber cómo prevenirla en tus aplicaciones?",
    "seguridad": "La seguridad es fundamental en el desarrollo de software. ¿Necesitas recomendaciones sobre buenas prácticas?",
    "encriptacion": "La encriptación protege datos sensibles. ¿Buscas información sobre algoritmos de cifrado?",
    "hash": "Las funciones hash son útiles para verificar la integridad de los datos. ¿Te interesa un ejemplo práctico?",
    "scripting": "El scripting automatiza tareas repetitivas en el desarrollo. ¿Te gustaría aprender sobre Bash o PowerShell?",
    "database": "Las bases de datos son esenciales para almacenar información. ¿Tienes dudas sobre diseño o consultas?",
    "postgresql": "PostgreSQL es una base de datos relacional avanzada. ¿Necesitas ayuda con consultas o configuraciones?",
    "mysql": "MySQL es ampliamente utilizado en el desarrollo web. ¿Buscas optimización o solución de errores?",
    "mongodb": "MongoDB es una base de datos NoSQL popular y flexible. ¿Quieres aprender sobre su modelo de documentos?",
    "nosql": "Las bases de datos NoSQL ofrecen alternativas a los sistemas relacionales. ¿Te gustaría ver ejemplos de uso?",
    "version": "El control de versiones es vital en el desarrollo colaborativo. ¿Usas Git o alguna otra herramienta?",
    "git": "Git es la herramienta líder para control de versiones. ¿Necesitas ayuda con comandos o flujos de trabajo?",
    "github": "GitHub es una plataforma popular para alojar repositorios Git. ¿Te interesa aprender sobre pull requests?",
    "bitbucket": "Bitbucket es otra opción para el control de versiones. ¿Quieres comparar sus ventajas con GitHub?",
    "devops": "DevOps integra desarrollo y operaciones para mejorar la entrega de software. ¿Te gustaría saber más sobre CI/CD?",
    "docker": "Docker permite la contenedorización de aplicaciones para facilitar despliegues. ¿Necesitas ayuda para crear contenedores?",
    "kubernetes": "Kubernetes orquesta contenedores a gran escala. ¿Te interesa aprender sobre pods y servicios?",
    "virtualizacion": "La virtualización permite ejecutar múltiples sistemas en una sola máquina. ¿Quieres saber sobre VMs o containers?",
    "linux": "Linux es un sistema operativo robusto y flexible para desarrolladores. ¿Necesitas ayuda con comandos o distribuciones?",
    "windows": "Windows es muy utilizado en entornos corporativos. ¿Te gustaría conocer herramientas de desarrollo para este SO?",
    "mac": "macOS es popular entre desarrolladores por su entorno Unix. ¿Necesitas recomendaciones de software o atajos?",
    "sistemaoperativo": "El sistema operativo gestiona el hardware y el software. ¿Te interesa saber sobre su arquitectura?",
    "redes": "Las redes permiten la comunicación entre dispositivos. ¿Quieres aprender sobre protocolos o configuraciones?",
    "internet": "Internet conecta el mundo a través de protocolos como HTTP y TCP/IP. ¿Te interesa algún aspecto en particular?",
    "socket": "Los sockets permiten comunicación en red a bajo nivel. ¿Te gustaría ver un ejemplo en Python o Java?",
    "websocket": "WebSockets habilitan comunicación en tiempo real entre cliente y servidor. ¿Quieres aprender a implementarlos?",
    "servidor": "El servidor procesa las peticiones y envía respuestas. ¿Necesitas configurar uno o entender su funcionamiento?",
    "cliente": "El cliente interactúa con el servidor para consumir servicios. ¿Quieres aprender sobre arquitecturas cliente-servidor?",
    "frontend": "El frontend se encarga de la interfaz de usuario. ¿Buscas consejos sobre frameworks o diseño responsivo?",
    "backend": "El backend gestiona la lógica y el almacenamiento de datos. ¿Necesitas ayuda con APIs o microservicios?",
    "fullstack": "El desarrollo fullstack abarca tanto frontend como backend. ¿Te interesa ampliar tus conocimientos en ambas áreas?",
    "programar": "Programar es el arte de resolver problemas mediante código. ¿Te gustaría recibir consejos o tutoriales?",
    "codigo": "El código es la base de cualquier aplicación. ¿Buscas mejorar su legibilidad o rendimiento?",
    "debuggear": "Debuggear es esencial para encontrar y solucionar errores. ¿Te gustaría aprender técnicas avanzadas?",
    "testing": "Las pruebas de software aseguran la calidad del código. ¿Te interesa aprender sobre unit testing o TDD?",
    "unitario": "Las pruebas unitarias verifican la funcionalidad de cada componente. ¿Quieres ejemplos o frameworks recomendados?",
    "integracion": "Las pruebas de integración aseguran que los módulos funcionen correctamente en conjunto. ¿Necesitas ejemplos o herramientas?",
    "ci": "La integración continua automatiza la fusión de cambios en el código. ¿Te interesa saber sobre Jenkins o GitLab CI?",
    "cd": "El despliegue continuo agiliza la entrega de software a producción. ¿Quieres aprender sobre pipelines y automatización?",
    "machine": "Machine Learning abre un mundo de posibilidades en programación. ¿Necesitas recursos para empezar con modelos de ML?",
    "learning": "Learning implica aprender de forma continua. ¿Te interesa conocer cursos o tutoriales para mejorar tus habilidades?",
    "creador": "Fui creado por un desarrollador apasionado llamado Albert Beltran. ¿En qué puedo ayudarte hoy?",
    "guerra":"La guerra, la guerra no cambia nunca",
    "jv": "Jose Vicente es un gran profesor de programación, que enseña en Tame Formacion, puedes encontrarlo en Jocarsa.com"
}